In [1]:
import pandas as pd

print(pd.__version__)   # Check pandas version

# Test creating a Series
s = pd.Series([10, 20, 30, 40])
print(s)

2.1.4
0    10
1    20
2    30
3    40
dtype: int64

In [2]:
import numpy as np

print(np.__version__)        # Show version
print(np.array([1, 2, 3]))    # Simple test

1.26.4
[1 2 3]

In [3]:
import numpy as np
import pandas as pd

In [4]:
print(pd.__version__)

2.1.4

In [5]:
data = np.random.randint(10,30,10)
data

array([17, 29, 26, 27, 16, 12, 10, 16, 16, 22])

In [6]:
type(data)

numpy.ndarray

In [8]:
#Creating Serise
series = pd.Series(data)
series

0    17
1    29
2    26
3    27
4    16
5    12
6    10
7    16
8    16
9    22
dtype: int32

In [9]:
type(series)

pandas.core.series.Series

In [10]:
#Operation in Pandas Series
# To Search a value from index
series[4]

16

In [12]:
series[8]

16

In [13]:
series >20

0    False
1     True
2     True
3     True
4    False
5    False
6    False
7    False
8    False
9     True
dtype: bool

In [15]:
series < 10

0    False
1    False
2    False
3    False
4    False
5    False
6    False
7    False
8    False
9    False
dtype: bool

In [16]:
# Search a Value greater than 20
series[series>20]

1    29
2    26
3    27
9    22
dtype: int32

In [17]:
#Introduction to Pandas DataFram
# Creating DataFrame From Dictionary OF Pandas Serise

In [18]:
data1 = {
    "Name": ["Akash", "Hello", "World"],
    "Age": [25, 30, 35],
    "City": ["Chd", "Punjab", "Delhi"]
}

In [21]:
(data1)

{'Name': ['Akash', 'Hello', 'World'],
 'Age': [25, 30, 35],
 'City': ['Chd', 'Punjab', 'Delhi']}

In [25]:
df1 = pd.DataFrame(data1)
(df1)

    Name  Age    City
0  Akash   25     Chd
1  Hello   30  Punjab
2  World   35   Delhi

In [28]:
import pandas as pd
import numpy as np

data = {
    'a': pd.Series(np.random.randint(10, 20, 5)),
    'b': pd.Series(np.random.randint(5, 8, 5)),
    'c': pd.Series(5, index=[0, 1, 2])
}
print(data)

{'a': 0    10
1    12
2    12
3    17
4    16
dtype: int32, 'b': 0    5
1    5
2    5
3    6
4    7
dtype: int32, 'c': 0    5
1    5
2    5
dtype: int64}

In [29]:
type(data)

dict

In [30]:
#converting Dicationary OF Pandas Seeries TO dataframe
df = pd.DataFrame(data)
df

    a  b    c
0  10  5  5.0
1  12  5  5.0
2  12  5  5.0
3  17  6  NaN
4  16  7  NaN

In [31]:
df.loc[2:3,'b']

2    5
3    6
Name: b, dtype: int32

In [33]:
data2 = [{'p' : 2 , 'q' : 4} , {'p' : 5 , 'q' : 10 , 'r' : 15}]

In [34]:
pd.DataFrame(data2)

   p   q     r
0  2   4   NaN
1  5  10  15.0

In [35]:
pd.DataFrame(data2 , index = [ 'IIT' , 'Academy'])

         p   q     r
IIT      2   4   NaN
Academy  5  10  15.0

In [36]:
pd.DataFrame(data2 , columns = ['p' , 'q'])

   p   q
0  2   4
1  5  10

In [37]:
#Basic Functionality  / Operations on DataFrame

In [39]:
# Extracting a column from dataframe
n = df['a']#for single column only
n

0    10
1    12
2    12
3    17
4    16
Name: a, dtype: int32

In [40]:
n1 = df[['a' , 'b']]
n1

    a  b
0  10  5
1  12  5
2  12  5
3  17  6
4  16  7

In [41]:
type(n1)

pandas.core.frame.DataFrame

In [42]:
type(n)

pandas.core.series.Series

In [44]:
#Extracting 2 ormore column from dataframe
p = df[['a' , 'b' , 'c']]
p

    a  b    c
0  10  5  5.0
1  12  5  5.0
2  12  5  5.0
3  17  6  NaN
4  16  7  NaN

In [45]:
type(p)

pandas.core.frame.DataFrame

In [46]:
df

    a  b    c
0  10  5  5.0
1  12  5  5.0
2  12  5  5.0
3  17  6  NaN
4  16  7  NaN

In [47]:
df.loc[2:,]

    a  b    c
2  12  5  5.0
3  17  6  NaN
4  16  7  NaN

In [48]:
#Extact an element from datafram using Row Index
df.loc[2]

a    12.0
b     5.0
c     5.0
Name: 2, dtype: float64

In [49]:
#Extract an element from dataframe using row Index and column Index
df.loc[ 2 , 'b']

5

In [50]:
#Slicing multiple element from dataframe using row index and column index
df.loc[2:3 , 'b':'c']

   b    c
2  5  5.0
3  6  NaN

In [51]:
df.loc[2:,]

    a  b    c
2  12  5  5.0
3  17  6  NaN
4  16  7  NaN

In [67]:

df5 = pd.DataFrame(
    [[4, 7, 10],
     [5, 8, 11],
     [6, 9, 12]],
    index=[13, 14, 15],
    columns=['a', 'b', 'c']
)

df5

    a  b   c
13  4  7  10
14  5  8  11
15  6  9  12

In [58]:
df.loc[0:1 , 'b' : 'c']

   b    c
0  5  5.0
1  5  5.0

In [59]:
type(df)

pandas.core.frame.DataFrame

In [68]:
import pandas as pd

In [69]:
df6 = pd.DataFrame(
    [[4, 7, 10],
     [5, 8, 11],
     [6, 9, 12]],
    index=[13, 14, 15]
)

df6

    0  1   2
13  4  7  10
14  5  8  11
15  6  9  12

In [70]:
df

    a  b    c
0  10  5  5.0
1  12  5  5.0
2  12  5  5.0
3  17  6  NaN
4  16  7  NaN

In [71]:
df.loc[0:1 , 'b':'c']

   b    c
0  5  5.0
1  5  5.0

In [72]:
type(df)

pandas.core.frame.DataFrame

In [73]:
import pandas as pd

In [76]:
df8 = pd.DataFrame(
    {'a' : [ 1 , 2 , 3 , 7],
     'b' : [ 4 , 5 , 6 , 8],
     'c' : [7 , 8 , 9 , 9 ],
     'd' : [ 1 , 7 , 9 , 0],
     'e' : [ 8 , 9 , 9 , 1]
    },
index = [10 , 2 , 3 , 4]
)
df8

    a  b  c  d  e
10  1  4  7  1  8
2   2  5  8  7  9
3   3  6  9  9  9
4   7  8  9  0  1

In [78]:
df9 = df8.rename(columns = {'c':'c1'})
df9

    a  b  c1  d  e
10  1  4   7  1  8
2   2  5   8  7  9
3   3  6   9  9  9
4   7  8   9  0  1

In [79]:
df8

    a  b  c  d  e
10  1  4  7  1  8
2   2  5  8  7  9
3   3  6  9  9  9
4   7  8  9  0  1

In [80]:
df8.rename(columns = {'c':'c1'} , inplace = True)
df8

    a  b  c1  d  e
10  1  4   7  1  8
2   2  5   8  7  9
3   3  6   9  9  9
4   7  8   9  0  1

In [83]:
#Order rows by values of a colunm(high to low).
df8.sort_values('c1' , ascending = False)

    a  b  c1  d  e
3   3  6   9  9  9
4   7  8   9  0  1
2   2  5   8  7  9
10  1  4   7  1  8

In [84]:
#select columns in position 1 , 2 and 5 (first column is 0).
df8.iloc[:,2:3]

    c1
10   7
2    8
3    9
4    9

In [86]:
df8.iloc[:,[1,2,3]]

    b  c1  d
10  4   7  1
2   5   8  7
3   6   9  9
4   8   9  0

In [88]:
df8.loc[df8['a'] > 5, ['a' , 'c1']]

   a  c1
4  7   9

In [89]:
#Statistical Operations ON pandas DataFrame

In [90]:
df8

    a  b  c1  d  e
10  1  4   7  1  8
2   2  5   8  7  9
3   3  6   9  9  9
4   7  8   9  0  1

In [93]:
#Find mean column Wise - Default Columnwise(axis = 0)
df8.mean()

a     3.25
b     5.75
c1    8.25
d     4.25
e     6.75
dtype: float64

In [94]:
#Find Mean Rowwise
df8.mean(axis = 1)

10    4.2
2     6.2
3     7.2
4     5.0
dtype: float64

In [95]:
#find sum COLumnwise
df8.sum()

a     13
b     23
c1    33
d     17
e     27
dtype: int64

In [96]:
#find sum rowwisw
df8.sum(axis = 1)

10    21
2     31
3     36
4     25
dtype: int64

In [97]:
df

    a  b    c
0  10  5  5.0
1  12  5  5.0
2  12  5  5.0
3  17  6  NaN
4  16  7  NaN

In [98]:
df.isnull()

       a      b      c
0  False  False  False
1  False  False  False
2  False  False  False
3  False  False   True
4  False  False   True

In [99]:
df.isnull().sum()

a    0
b    0
c    2
dtype: int64

In [104]:
#DROP COLUMNS WITH MISSING VALUE
df.dropna(axis= 1)

    a  b
0  10  5
1  12  5
2  12  5
3  17  6
4  16  7

In [105]:
#DROP ROW WITH MISSING VALUE
df.dropna(axis= 0)

    a  b    c
0  10  5  5.0
1  12  5  5.0
2  12  5  5.0

In [106]:
#FILL NA VALUE WITH 0 ---> FILL HAPPENS ON ORIGINAL DF
df.fillna(0)

    a  b    c
0  10  5  5.0
1  12  5  5.0
2  12  5  5.0
3  17  6  0.0
4  16  7  0.0

In [107]:
#filling na by forward fill ---> fill happens an original df
df.fillna(method = 'ffill')

C:\Users\SHUBHAM\AppData\Local\Temp\ipykernel_28116\1332568098.py:2: FutureWarning: DataFrame.fillna with 'method' is deprecated and will raise in a future version. Use obj.ffill() or obj.bfill() instead.
  df.fillna(method = 'ffill')

    a  b    c
0  10  5  5.0
1  12  5  5.0
2  12  5  5.0
3  17  6  5.0
4  16  7  5.0

In [108]:
df.fillna(df.mean())

    a  b    c
0  10  5  5.0
1  12  5  5.0
2  12  5  5.0
3  17  6  5.0
4  16  7  5.0

In [109]:
#import and exporting Data

In [113]:
import numpy as np
import pandas as pd

In [114]:
pwd

'C:\\Users\\SHUBHAM'

In [122]:
data = pd.read_excel('C:\\Users\\SHUBHAM\\OneDrive\\Documents\iris.xlsx')
data

     Sepal.Length  Sepal.Width  Petal.Length  Petal.Width    Species
0             5.1          3.5           1.4          0.2     setosa
1             4.9          3.0           1.4          0.2     setosa
2             4.7          3.2           1.3          0.2     setosa
3             4.6          3.1           1.5          0.2     setosa
4             5.0          3.6           1.4          0.2     setosa
..            ...          ...           ...          ...        ...
145           6.7          3.0           5.2          2.3  virginica
146           6.3          2.5           5.0          1.9  virginica
147           6.5          3.0           5.2          2.0  virginica
148           6.2          3.4           5.4          2.3  virginica
149           5.9          3.0           5.1          1.8  virginica

[150 rows x 5 columns]

In [130]:
data.head(10)

   Sepal.Length  Sepal.Width  Petal.Length  Petal.Width Species
0           5.1          3.5           1.4          0.2  setosa
1           4.9          3.0           1.4          0.2  setosa
2           4.7          3.2           1.3          0.2  setosa
3           4.6          3.1           1.5          0.2  setosa
4           5.0          3.6           1.4          0.2  setosa
5           5.4          3.9           1.7          0.4  setosa
6           4.6          3.4           1.4          0.3  setosa
7           5.0          3.4           1.5          0.2  setosa
8           4.4          2.9           1.4          0.2  setosa
9           4.9          3.1           1.5          0.1  setosa

In [129]:
data.tail(5)

     Sepal.Length  Sepal.Width  Petal.Length  Petal.Width    Species
145           6.7          3.0           5.2          2.3  virginica
146           6.3          2.5           5.0          1.9  virginica
147           6.5          3.0           5.2          2.0  virginica
148           6.2          3.4           5.4          2.3  virginica
149           5.9          3.0           5.1          1.8  virginica

In [132]:
data.to_excel('C:/Users/SHUBHAM/Downloads/irisnew.xlsx')